import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/framework.dart';
import 'package:flutter/src/widgets/placeholder.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class AboutApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Color(0xFFE5E5E5),
      appBar: AppBar(
        title: Text("অ্যাপ সম্পর্কে"),
      ),
      body: Padding(
        padding: const EdgeInsets.symmetric(vertical: 10, horizontal: 15),
        child: SingleChildScrollView(
          scrollDirection: Axis.vertical,
          child: Text(
            "আপনি যেহেতু এই লেখাটি পড়তেছেন তাহলে নিশ্চয়ই আবহাওয়া পূর্বাভাস  অ্যাপটি ইন্সটল করেছেন । আপনাকে এই অ্যাপে স্বাগতম। \n\nআমাদের এই অ্যাপের মাধ্যমে হাতের মুঠোই পাবেন আবহাওয়ার পূর্বাভাস। সারা বিশ্বের আবহাওয়া তথ্যের উপর ভিত্তি করে পূর্বাভাস দেওয়া হয়। এই তথ্য বিশ্লেষণ করে প্রতি ১৫ মিনিট পর পর আপডেট করা হয় । একটি বিষয় মনে রাখতে হবে যে, এই পূর্বাভাস গুলো সাধারণত সম্ভাব্যতার উপর ভিত্তি করে হয়ে থাকে। অন্যভাবে বললে আবহাওয়ায় বিশেষ কোন পরিবর্তনের সম্ভাবনা কতটা সেটা জানা যায় । এর মানে সবসময় কিছু অনিশ্চয়তা থাকে।  কিছু তথ্য পরিবর্তন হতে পারে । \n\n\nএই অনিশ্চিত তথ্য গুলো প্রকাশ করা একটু কঠিন। ধরুন, অ্যাপ বলছে বৃষ্টি হওয়ার সম্ভাবনা ৬০%। এই ৬০% ধারনা দেয় যে বৃষ্টির ব্যাপারে আপনার কতটা নিশ্চিত হওয়া উচিত। এর মানে এই নয় যে দিনের ৬০% সময় বৃষ্টি হবে। এর মানে এই নয় যে ৬০% এলাকায় বৃষ্টি হবে । \n\nএখানে নতুন তথ্য পাওয়ার সাথে সাথে নতুন পূর্বাভাস দেওয়া হয় এর মানে এই নয় যে প্রাথমিক পূর্বাভাস ভুল ছিল। অ্যাপটি এমন ভাবে বানানো করা হয়েছে যাতে অ্যাপটি ১৫ মিনিট পর পর আপডেট হয় এবং সাথে নতুন কোন পূর্বাভাস থাকলে সেটাও যুক্ত হয়।  তাই আপনি যত সামনে তাকাবেন, সম্ভাব্য তথ্য গুলো ততোটাই বদলে যাবে। \n\nকিছু আবহাওয়ার পূর্বাভাস দেওয়া তুলনামূলক কঠিন। তাপমাত্রা সাধারণত নির্ভুল হয়  তবে বৃষ্টি পাতের পূর্বাভাস দেওয়া বেশ কঠিন। এর কারণ বৃষ্টি খুব অল্প সময়ের জন্য একটি ছোট এলাকা জুড়ে হয় এবং বাতাসের গতিপথের সামান্য পরিবর্তনের কারণে বৃষ্টির গতিপথের আগের অবস্থান থেকে সরে যেতে পাড়ে। তাই আবহাওয়ার পূর্বাভাস দেওয়া খুবই কঠিন। কারণ বায়ুমণ্ডলে খুব দ্রুত পরিবর্তন আসে। \n\nতবে আবহাওয়া কেমন হতে পাড়ে সেই ধারনা দিতে এই অ্যাপ দুর্দান্ত কাজ করে। আর প্রযুক্তির উন্নয়নের সাথে সাথে এই অ্যাপও উন্নত হচ্ছে। ",
            style: TextStyle(
                fontSize: 19.sp,
                color: Colors.black,
                fontWeight: FontWeight.w500),
          ),
        ),
      ),
    );
  }
}
